pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.h
//------------------------------------- 'midrange_routine_definition' non terminal
//--- 'parse' label
  public : virtual void nt_midrange_5F_routine_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_midrange_5F_routine_5F_definition_ (GALGAS_midrange_5F_routineDefinitionList & ioArgument0,
                                                               GALGAS_bool & ioArgument1,
                                                               GALGAS_bool & ioArgument2,
                                                               C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'midrange_simple_instruction' non terminal
//--- 'parse' label
  public : virtual void nt_midrange_5F_simple_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_midrange_5F_simple_5F_instruction_ (GALGAS_midrange_5F_instruction & outArgument0,
                                                               C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'midrange_structured_if_instruction' non terminal
//--- 'parse' label
  public : virtual void nt_midrange_5F_structured_5F_if_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_midrange_5F_structured_5F_if_5F_instruction_ (GALGAS_midrange_5F_instruction & outArgument0,
                                                                         GALGAS_bool & ioArgument1,
                                                                         GALGAS_bool & ioArgument2,
                                                                         C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'midrange_structured_instruction' non terminal
//--- 'parse' label
  public : virtual void nt_midrange_5F_structured_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_midrange_5F_structured_5F_instruction_ (GALGAS_midrange_5F_instruction & outArgument0,
                                                                   GALGAS_bool & ioArgument1,
                                                                   GALGAS_bool & ioArgument2,
                                                                   C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'optional_w_as_dest' non terminal
//--- 'parse' label
  public : virtual void nt_optional_5F_w_5F_as_5F_dest_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_optional_5F_w_5F_as_5F_dest_ (GALGAS_bool & outArgument0,
                                                         C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'parse_bootloader' non terminal
//--- 'parse' label
  public : virtual void nt_parse_5F_bootloader_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_parse_5F_bootloader_ (GALGAS_lstring & outArgument0,
                                                 GALGAS_lstring & outArgument1,
                                                 GALGAS_routineDeclarationList & outArgument2,
                                                 GALGAS_bootloaderReservedRAMmap & outArgument3,
                                                 GALGAS_luint & outArgument4,
                                                 GALGAS_routineDeclarationList & outArgument5,
                                                 GALGAS_ramDefinitionList & outArgument6,
                                                 GALGAS_string & outArgument7,
                                                 GALGAS_piccoloDeviceModel & outArgument8,
                                                 GALGAS_uint & outArgument9,
                                                 GALGAS_ramBankTable & outArgument10,
                                                 GALGAS_registerTable & outArgument11,
                                                 C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'ram_definition' non terminal
//--- 'parse' label
  public : virtual void nt_ram_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_ram_5F_definition_ (GALGAS_ramDefinitionList & ioArgument0,
                                               C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'register_parsing' non terminal
//--- 'parse' label
  public : virtual void nt_register_5F_parsing_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_register_5F_parsing_ (GALGAS_registerExpression & outArgument0,
                                                 C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'routine_declaration' non terminal
//--- 'parse' label
  public : virtual void nt_routine_5F_declaration_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_routine_5F_declaration_ (GALGAS_routineDeclarationList & ioArgument0,
                                                    C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'routine_definition' non terminal
//--- 'parse' label
  public : virtual void nt_routine_5F_definition_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_routine_5F_definition_ (GALGAS_routineDefinitionList & ioArgument0,
                                                   GALGAS_bool & ioArgument1,
                                                   GALGAS_bool & ioArgument2,
                                                   C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'section_list' non terminal
//--- 'parse' label
  public : virtual void nt_section_5F_list_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_section_5F_list_ (GALGAS_baseline_5F_routineDefinitionList & ioArgument0,
                                             GALGAS_ramDefinitionList & ioArgument1,
                                             GALGAS_lstringlist & ioArgument2,
                                             GALGAS_configDefinitionList & ioArgument3,
                                             GALGAS_constantDefinitionList & ioArgument4,
                                             C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'simple_instruction' non terminal
//--- 'parse' label
  public : virtual void nt_simple_5F_instruction_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_simple_5F_instruction_ (GALGAS_pic_31__38_PiccoloSimpleInstruction & outArgument0,
                                                   C_Lexique_piccolo_5F_lexique * inCompiler) ;

//------------------------------------- 'start_symbol' non terminal
//--- 'parse' label
  public : virtual void nt_start_5F_symbol_parse (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//----------- '' label
  public : virtual void nt_start_5F_symbol_ (C_Lexique_piccolo_5F_lexique * inCompiler) ;

//--- Start symbol
  public : static void _performSourceFileParsing_ (C_Compiler * inCompiler,
                                                   GALGAS_lstring inFileName
                                                   COMMA_LOCATION_ARGS) ;

  public : static void _performSourceStringParsing_ (C_Compiler * inCompiler,
                                                     GALGAS_string inSourceString
                                                     COMMA_LOCATION_ARGS) ;

//----------- 'importBootloaderSpecification' label
  public : virtual void nt_start_5F_symbol_importBootloaderSpecification (GALGAS_piccoloDeviceModel & outArgument0,
                                                                          GALGAS_string & outArgument1,
                                                                          GALGAS_uint & outArgument2,
                                                                          GALGAS_ramBankTable & outArgument3,
                                                                          GALGAS_registerTable & outArgument4,
                                                                          GALGAS_bootloaderReservedRAMmap & outArgument5,
                                                                          GALGAS_routineDeclarationList & outArgument6,
                                                                          GALGAS_routineDeclarationList & outArgument7,
                                                                          GALGAS_luint & outArgument8,
                                                                          C_Lexique_piccolo_5F_lexique * inCompiler) ;

//--- Start symbol
  public : static void _performSourceFileParsing_importBootloaderSpecification (C_Compiler * inCompiler,
                                                                                GALGAS_lstring inFileName,
                                                                                GALGAS_piccoloDeviceModel & outArgument0,
                                                                                GALGAS_string & outArgument1,
                                                                                GALGAS_uint & outArgument2,
                                                                                GALGAS_ramBankTable & outArgument3,
                                                                                GALGAS_registerTable & outArgument4,
                                                                                GALGAS_bootloaderReservedRAMmap & outArgument5,
                                                                                GALGAS_routineDeclarationList & outArgument6,
                                                                                GALGAS_routineDeclarationList & outArgument7,
                                                                                GALGAS_luint & outArgument8
                                                                                COMMA_LOCATION_ARGS) ;

  public : static void _performSourceStringParsing_importBootloaderSpecification (C_Compiler * inCompiler,
                                                                                  GALGAS_string inSourceString,
                                                                                  GALGAS_piccoloDeviceModel & outArgument0,
                                                                                  GALGAS_string & outArgument1,
                                                                                  GALGAS_uint & outArgument2,
                                                                                  GALGAS_ramBankTable & outArgument3,
                                                                                  GALGAS_registerTable & outArgument4,
                                                                                  GALGAS_bootloaderReservedRAMmap & outArgument5,
                                                                                  GALGAS_routineDeclarationList & outArgument6,
                                                                                  GALGAS_routineDeclarationList & outArgument7,
                                                                                  GALGAS_luint & outArgument8
                                                                                  COMMA_LOCATION_ARGS) ;

