pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_grammar.h
  public : virtual PMSInt32 select_midrange_5F_syntax_10 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_11 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_12 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_13 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_14 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_15 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_16 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_17 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_18 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_19 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_20 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_21 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_22 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_23 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_24 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_25 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_midrange_5F_syntax_26 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_0 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_1 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_2 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_3 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_4 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_5 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_6 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_7 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_8 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_9 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_10 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_11 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_12 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_13 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_14 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_15 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_16 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_17 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_18 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_19 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_20 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_baseline_5F_syntax_21 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_0 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_1 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_2 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_3 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_4 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_5 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_pic_31__38__5F_bootloader_5F_syntax_6 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_0 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_1 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_2 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_3 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_4 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_5 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_6 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_7 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_8 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_9 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_10 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_11 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_12 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_13 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_14 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_15 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_16 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_17 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_18 (C_Lexique_piccolo_5F_lexique *) ;

  public : virtual PMSInt32 select_communs_19 (C_Lexique_piccolo_5F_lexique *) ;
} ;

//---------------------------------------------------------------------------*

#endif
